const zr = [
    { name_of_actv: "Данні клієнтів", owner_actv: "Адміністратор", location: "ПК №4", category_actv: "ЕД", zagroza: "Зловживання ресурсами", dzerelo_zagrozy: "Приймальники", mechanism: "Здійснення приймальниками модифікації чи знищення данних клієнтів через відсутність правил поведінки адміністратора при залишенні ним робочого місця та ПК №4. " },
    { name_of_actv: "Данні клієнтів", owner_actv: "Адміністратор", location: "ПК №4", category_actv: "ЕД", zagroza: "Зловживання ресурсами", dzerelo_zagrozy: "Приймальники", mechanism: "Сканується мережу на наявність відкритий портів. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост від'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Доступ до аудіофайлів та фотофайлів в пам'яті ПК №6  через відкритий порт. Внаслідок відсутності програмного забезпечення брандмауер " },
  ];

  const hak = [
    { name_of_actv: "Данні клієнтів", owner_actv: "Адміністратор", location: "ПК №4", category_actv: "ЕД", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій (ІТ) конкуруючої фірми", mechanism: "Видалення або модифікація данних клієнтів шляхом проникнення через відкритий порт. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Програма, скануючи ІР адресу, виводить на екран список відкритих портів та з якими хостами здійснюється зв'язок через даний порт. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост вд'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Відсутність налаштування програмного забезпечення брандмауер, процедури щоденного оновлення антивірусних баз та резервного копіювання даних. Спеціаласт з ІТ сканує мережу на наявність відкритий портів. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Програма, скануючи ІР адресу, виводить на екран список відкритих портів та з якими хостами здійснюється зв'язок через даний порт. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост вд'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Встановлення шкідливого програмного забезпечення Spyware (дане програмне забезпечення видаляє електронні файли, в тому числі та програмне забезпечення, якщо вказати необхідний критерій відбору ЕД до видалення) на сервер через відкритий порт. Відсутність процедури сканування системи на наявність шкідливиї програм." },
    { name_of_actv: "Данні про працівників", owner_actv: "Адміністратор", location: "ПК №4", category_actv: "ЕД", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій конкуруючої фірми", mechanism: "Видалення аудіофайлів шляхом проникнення через відкритий порт. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Програма, скануючи ІР адресу, виводить на екран список відкритих портів та з якими хостами здійснюється зв'язок через даний порт. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост вд'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Відсутність налаштування програмного забезпечення брандмауер, процедури щоденного оновлення антивірусних баз." },
    { name_of_actv: "Програмне забезпечення ПК №4", owner_actv: "Адміністратор", location: "ПК №4", category_actv: "ПЗ", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій конкуруючої фірми", mechanism: "Хакер сканує мережу на наявність відкритий портів. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Програма, скануючи ІР адресу, виводить на екран список відкритих портів та з якими хостами здійснюється зв'язок через даний порт. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост вд'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Встановлення шкідливого програмного забезпечення Spyware(дане програмне забезпечення видаляє електронні файли, в тому числі та програмне забезпечення, якщо вказати необхідний критерій відбору ЕД до видалення)  на ПК через відкритий порт. Відсутність процедури сканування системи на наявність шкідливих програм. Відсутність налаштування програмного забезпечення брандмауер" },
    { name_of_actv: "Програмне забезпечення сервера", owner_actv: "Адміністратор", location: "Сервер", category_actv: "ПЗ", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій конкуруючої фірми", mechanism: "Спеціаласт з ІТ сканує мережу на наявність відкритий портів. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Програма, скануючи ІР адресу, виводить на екран список відкритих портів та з якими хостами здійснюється зв'язок через даний порт. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост вд'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Встановлення шкідливого програмного забезпечення Spyware (дане програмне забезпечення видаляє електронні файли, в тому числі та програмне забезпечення, якщо вказати необхідний критерій відбору ЕД до видалення) на сервер через відкритий порт. Відсутність процедури сканування системи на наявність шкідливиї програм." },
    { name_of_actv: "Дані компанії", owner_actv: "Адміністратор", location: "Сервер", category_actv: "ПЗ", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій, можливо з конкуруючої фірми", mechanism: "За допомогою XSS-ін'єкції (зміна HTML-коду сайту, впровадження довільного коду на  HTML-сторінку, з будь-яким змістом. Передача даного коду як змінної, фільтрація по якій не працює, тобто змінна не перевіряється сервером на наявність заборонених знаків. Після атаки PHP-скрипт генерує  HTML-сторінку, на якій відображаються знічення змінної потрібних для хакера і відправляє цю сторінку на браузер). Дана атака шкодить репутації радіостудії (коли користувач відкриває сайт радіостудії у власному браузері-шкідливий код запускається на виконнання. Даний код пересилає всю інформацію про паролі, рахунки та ін на комп'ютер хакера). Відсутність екранування спецсимволів в коді HTML." },
    { name_of_actv: "Дані компанії", owner_actv: "Адміністратор", location: "ПК №6", category_actv: "ПЗ", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій, можливо з конкуруючої фірми", mechanism: "Сканується мережу на наявність відкритий портів. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Програма, скануючи ІР адресу, виводить на екран список відкритих портів і з якими хостами здійснюється зв'язок через даний порт. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост вд'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Отримавши доступ через відкритий порт,  видаляє або модифікує ЕД . Відсутність програмного забезпечення резервного копіювання даних на ПК №6. Відсутність налаштування програмного забезпечення брандмауер." },
    { name_of_actv: "Програмне забезпечення ПК №1, №2, №3, №4", owner_actv: "Адміністратор, приймальники", location: "ПК №1, №2, №3, №4", category_actv: "ПЗ", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій конкуруючої організації", mechanism: "Хакер сканує мережу на наявність відкритий портів. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Програма, скануючи ІР адресу, виводить на екран список відкритих портів і з якими хостами здійснюється зв'язок через даний порт. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост вд'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Отримавши доступ через відкритий порт, хакер видаляє необхідне програмне забезпечення(для перегляду та фотофайлів, текстових документів). Відсутність налаштування програмного забезпечення брандмауер." },
    { name_of_actv: "Програмне забезпечення сервера", owner_actv: "Адміністратор", location: "Сервер", category_actv: "ПЗ", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій конкуруючої організації", mechanism: "Хакер сканує мережу на наявність відкритий портів. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Програма, скануючи ІР адресу, виводить на екран список відкритих портів і з якими хостами здійснюється зв'язок через даний порт. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост вд'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Отримавши доступ через відкритий порт, спеціаліст з ІТ видаляє необхідне програмне забезпечення. Відсутність налаштування програмного забезпечення брандмауер." },
    { name_of_actv: "Сайт", owner_actv: "Адміністратор", location: "Сервер", category_actv: "ПЗ", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій конкуруючої організації", mechanism: "Хакер пише програмний код для DoS-атаки користуючись методом атаки через ботнет. Ботнет-це комп’ютерна мережа, яка складається з деякої кількості хостів із запущеним автономним програмним забезпеченням. При запуску програми на сервер сайту буде посилатися велика кількість запитів, які будуть опрацьовуватися в першу чергу, а не реальні запити від користувачів. Відсутність процедури маскування IР-адрес. Хакер сканує мережу на наявність відкритий портів. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Програма, скануючи ІР адресу, виводить на екран список відкритих портів і з якими хостами здійснюється зв'язок через даний порт. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост вд'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Отримує доступ через відкритий порт та впроваджує в систему віруси чи троянські програми, які блокують доступ до html-файлів на сервері, тому зупиняєтья робота сайту. Відсутність налаштування програмного забезпечення брандмауер, процедури щоденного оновлення антивірусних баз. " },
    { name_of_actv: "Данні клієнтів", owner_actv: "Адміністратор", location: "ПК №4", category_actv: "ПЗ", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій конкуруючої організації", mechanism: "Сканується мережу на наявність відкритий портів. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост від'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Доступ до аудіофайлів та фотофайлів в пам'яті ПК №6  через відкритий порт. Внаслідок відсутності програмного забезпечення брандмауер" },
    { name_of_actv: "Програмне забепечення ПК №1, №2, №3, №4", owner_actv: "Адміністратор, приймальники", location: "ПК №1, №2, №3, №4", category_actv: "ПЗ", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій конкуруючої організації", mechanism: "Хакер сканує мережу на наявність відкритий портів. Відкритий порт виявляється за допомогою програми Сканер портів( спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Програма, скануючи ІР адресу, виводить на екран список відкритих портів і з якими хостами здійснюється зв'язок через даний порт. Спеціаліст з ІТ змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост вд'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Доступ до налаштування програмного забезпечення на ПК №6 через відкритий порт. Внаслідок відсутності програмного забезпечення брандмауер" },
    { name_of_actv: "Програмне звбезпечення сервера", owner_actv: "Адміністратор", location: "Сервер", category_actv: "ПЗ", zagroza: "Хакер", dzerelo_zagrozy: "Спеціаліст з інформаційних технологій конкуруючої організації", mechanism: "Спеціаліст з ІТ сканує мережу на наявність відкритий портів. Відкритий порт виявляється за допомогою програми Сканер портів (Спеціаліст з ІТ запускає на власному комп'ютері програму Сканер портів. В даній програмі записується ІР адреса комп'ютера на який має здійснитися атака. Програма, скануючи ІР адресу, виводить на екран список відкритих портів і з якими хостами здійснюється зв'язок через даний порт.  змінює МАС-адресу свого хоста на МАС-адресу хоста з яким було встановлено зв'язок через відкритий порт та очікує, коли реальний хост вд'єднається від відкритого порта.) або сніферів (що дає можливість отримати інформацію про запущенні додатки). Доступ до налаштування програмного забезпечення на сервері через відкритий порт. Внаслідок відсутності програмного забезпечення брандмауер " },
  ];

  const np = [
    { name_of_actv: "Програмне забезпечення ПК №4", owner_actv: "Адміністратор", location: "ПК №4", category_actv: "ПЗ", zagroza: "Несправність ПЗ", dzerelo_zagrozy: "Внутрішні техногенні джерела загроз", mechanism: "Помилки в програмах обробки інформації, що можуть призвести до втрати або пошкодження інформаційних активів, внаслідок використання неякісних технічних засобів оброблення інформації" },
    { name_of_actv: "Програмне забезпечення сервера", owner_actv: "Адміністратор", location: "Сервер", category_actv: "ПЗ", zagroza: "Несправність ПЗ", dzerelo_zagrozy: "Внутрішні техногенні джерела загроз", mechanism: "Помилки в програмах обробки інформації, що можуть призвести до втрати або пошкодження інформаційних активів, внаслідок використання неякісних технічних засобів оброблення інформації" },
    { name_of_actv: "Дані клієнтів", owner_actv: "Адміністратор", location: "Лінія електропередачі", category_actv: "ПЗ", zagroza: "Несправність ПЗ", dzerelo_zagrozy: "Внутрішні техногенні джерела загроз", mechanism: "Неможливість доступу за рахунок виходу з ладу комп’ютера внаслідок короткого замикання. Відсутність джерел безперебійного живлення та відсутністю генератора збереження електроенергії або стабілізатора напруги." },
    { name_of_actv: "Дані працівників", owner_actv: "Адміністратор", location: "Лінія електропередачі", category_actv: "ПЗ", zagroza: "Несправність ПЗ", dzerelo_zagrozy: "Внутрішні техногенні джерела загроз", mechanism: "Неможливість доступу за рахунок виходу з ладу комп’ютера внаслідок короткого замикання. Відсутність джерел безперебійного живлення та відсутністю генератора збереження електроенергії або стабілізатора напруги." },
    { name_of_actv: "Програмне забезпечення сервера", owner_actv: "Адміністратор", location: "Лінія електропередачі", category_actv: "ПЗ", zagroza: "Несправність ПЗ", dzerelo_zagrozy: "Внутрішні техногенні джерела загроз", mechanism: "Перегрівання сервера, що спричинює його поломку внаслідок відсутності проведення контролю за запиленням охолоджувальної системи." },
    { name_of_actv: "Сайт", owner_actv: "Адміністратор", location: "Лінія електропередачі", category_actv: "ПЗ", zagroza: "Несправність ПЗ", dzerelo_zagrozy: "Внутрішні техногенні джерела загроз", mechanism: "Збої та відмови системи електроживлення, через що сервер вимикається. Відсутність джерел безперебійного живлення та відсутністю генератора збереження електроенергії або стабілізатора напруги." },
  ];

  const nd = [
    { name_of_actv: "Дані клієнтів", owner_actv: "Адміністратор", location: "ПК №4", category_actv: "ЕД", zagroza: "Ненавмисні дії", dzerelo_zagrozy: "Адміністратор", mechanism: "Ненавмисне видалення аудіофайлів та фотофайлів з пам'яті ПК. Відсутність програмного забезпечення резервного копіювання даних на ПК" },
  ];

  const sa = [
    { name_of_actv: "Сайт", owner_actv: "Адміністратор", location: "Сервер", category_actv: "ПЗ", zagroza: "Стихійні явища", dzerelo_zagrozy: "Стихійні явища", mechanism: "Пожежі, аварії та інші природні катаклізми внаслідок чого можуть статися пошкодження, що призупинять роботу сервера. Відсутність інструкції дій в надзвичайних ситуаціях." },
  ];
  
  const form = document.querySelector("#myForm");
  const tableBody = document.querySelector("#myTable tbody");
  
  form.addEventListener("submit", event => {
    event.preventDefault();
    const inputValue = document.querySelector("#input").value;
  
    if (inputValue === "Зловживання ресурсами") {
      // Clear table
      tableBody.innerHTML = "";
  
      // Loop through array and create table rows and cells
      zr.forEach(person => {
        const row = document.createElement("tr");
  
        const name_of_actvCell = document.createElement("td");
        name_of_actvCell.textContent = person.name_of_actv;
        row.appendChild(name_of_actvCell);
  
        const owner_actvCell = document.createElement("td");
        owner_actvCell.textContent = person.owner_actv;
        row.appendChild(owner_actvCell);
  
        const locationCell = document.createElement("td");
        locationCell.textContent = person.location;
        row.appendChild(locationCell);

        const category_actvCell = document.createElement("td");
        category_actvCell.textContent = person.category_actv;
        row.appendChild(category_actvCell);

        const zagrozaCell = document.createElement("td");
        zagrozaCell.textContent = person.zagroza;
        row.appendChild(zagrozaCell);

        const dzerelo_zagrozyCell = document.createElement("td");
        dzerelo_zagrozyCell.textContent = person.dzerelo_zagrozy;
        row.appendChild(dzerelo_zagrozyCell);

        const mechanismCell = document.createElement("td");
        mechanismCell.textContent = person.mechanism;
        row.appendChild(mechanismCell);
  
        tableBody.appendChild(row);
      });
    } else if (inputValue === "Хакер") {
        // Clear table
      tableBody.innerHTML = "";
  
      // Loop through array and create table rows and cells
      hak.forEach(person => {
        const row = document.createElement("tr");
  
        const name_of_actvCell = document.createElement("td");
        name_of_actvCell.textContent = person.name_of_actv;
        row.appendChild(name_of_actvCell);
  
        const owner_actvCell = document.createElement("td");
        owner_actvCell.textContent = person.owner_actv;
        row.appendChild(owner_actvCell);
  
        const locationCell = document.createElement("td");
        locationCell.textContent = person.location;
        row.appendChild(locationCell);

        const category_actvCell = document.createElement("td");
        category_actvCell.textContent = person.category_actv;
        row.appendChild(category_actvCell);

        const zagrozaCell = document.createElement("td");
        zagrozaCell.textContent = person.zagroza;
        row.appendChild(zagrozaCell);

        const dzerelo_zagrozyCell = document.createElement("td");
        dzerelo_zagrozyCell.textContent = person.dzerelo_zagrozy;
        row.appendChild(dzerelo_zagrozyCell);

        const mechanismCell = document.createElement("td");
        mechanismCell.textContent = person.mechanism;
        row.appendChild(mechanismCell);
  
        tableBody.appendChild(row);
      });
    } else if (inputValue === "Несправність ПЗ") {
        // Clear table
      tableBody.innerHTML = "";
  
      // Loop through array and create table rows and cells
      np.forEach(person => {
        const row = document.createElement("tr");
  
        const name_of_actvCell = document.createElement("td");
        name_of_actvCell.textContent = person.name_of_actv;
        row.appendChild(name_of_actvCell);
  
        const owner_actvCell = document.createElement("td");
        owner_actvCell.textContent = person.owner_actv;
        row.appendChild(owner_actvCell);
  
        const locationCell = document.createElement("td");
        locationCell.textContent = person.location;
        row.appendChild(locationCell);

        const category_actvCell = document.createElement("td");
        category_actvCell.textContent = person.category_actv;
        row.appendChild(category_actvCell);

        const zagrozaCell = document.createElement("td");
        zagrozaCell.textContent = person.zagroza;
        row.appendChild(zagrozaCell);

        const dzerelo_zagrozyCell = document.createElement("td");
        dzerelo_zagrozyCell.textContent = person.dzerelo_zagrozy;
        row.appendChild(dzerelo_zagrozyCell);

        const mechanismCell = document.createElement("td");
        mechanismCell.textContent = person.mechanism;
        row.appendChild(mechanismCell);
  
        tableBody.appendChild(row);
      });
    } else if (inputValue === "Ненавмисні дії") {
        // Clear table
      tableBody.innerHTML = "";
  
      // Loop through array and create table rows and cells
      nd.forEach(person => {
        const row = document.createElement("tr");
  
        const name_of_actvCell = document.createElement("td");
        name_of_actvCell.textContent = person.name_of_actv;
        row.appendChild(name_of_actvCell);
  
        const owner_actvCell = document.createElement("td");
        owner_actvCell.textContent = person.owner_actv;
        row.appendChild(owner_actvCell);
  
        const locationCell = document.createElement("td");
        locationCell.textContent = person.location;
        row.appendChild(locationCell);

        const category_actvCell = document.createElement("td");
        category_actvCell.textContent = person.category_actv;
        row.appendChild(category_actvCell);

        const zagrozaCell = document.createElement("td");
        zagrozaCell.textContent = person.zagroza;
        row.appendChild(zagrozaCell);

        const dzerelo_zagrozyCell = document.createElement("td");
        dzerelo_zagrozyCell.textContent = person.dzerelo_zagrozy;
        row.appendChild(dzerelo_zagrozyCell);

        const mechanismCell = document.createElement("td");
        mechanismCell.textContent = person.mechanism;
        row.appendChild(mechanismCell);
  
        tableBody.appendChild(row);
      });
    } else if (inputValue === "Стихійні явища") {
        // Clear table
      tableBody.innerHTML = "";
  
      // Loop through array and create table rows and cells
      sa.forEach(person => {
        const row = document.createElement("tr");
  
        const name_of_actvCell = document.createElement("td");
        name_of_actvCell.textContent = person.name_of_actv;
        row.appendChild(name_of_actvCell);
  
        const owner_actvCell = document.createElement("td");
        owner_actvCell.textContent = person.owner_actv;
        row.appendChild(owner_actvCell);
  
        const locationCell = document.createElement("td");
        locationCell.textContent = person.location;
        row.appendChild(locationCell);

        const category_actvCell = document.createElement("td");
        category_actvCell.textContent = person.category_actv;
        row.appendChild(category_actvCell);

        const zagrozaCell = document.createElement("td");
        zagrozaCell.textContent = person.zagroza;
        row.appendChild(zagrozaCell);

        const dzerelo_zagrozyCell = document.createElement("td");
        dzerelo_zagrozyCell.textContent = person.dzerelo_zagrozy;
        row.appendChild(dzerelo_zagrozyCell);

        const mechanismCell = document.createElement("td");
        mechanismCell.textContent = person.mechanism;
        row.appendChild(mechanismCell);
  
        tableBody.appendChild(row);
      });
    } else {
      // Clear table
      tableBody.innerHTML = "";
    }
  });
  
